src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаПланаПродаж_СтаршийМенеджер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ПланПродаж_День</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаршийМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_Месяц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиНаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_21</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_22</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_23</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_24</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_25</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_26</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_27</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_28</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_29</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_30</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_31</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРаспределения</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФактПрошлыйГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИТ_ПланПродаж_Месяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИТ_ПланПродаж_Месяц</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_ВидыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИТ_СтатусыПлановПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_СтатусыПлановПродаж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИТ_ВидыПлановПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_ВидыПлановПродаж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предварительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окончательный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер/Forms/ФормаСогласованиеПланаПродаж/Ext/Form/Module.bsl
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	ПериодПлана = КонецМесяца(ТекущаяДата());
	ПериодПлана = ПериодПлана + 15 * 86400; 
	ПериодПлана = НачалоМесяца(ПериодПлана);
	
	ОбновитьПланПродажНаСервере();	
	ОбновитьПраваДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПланПродаж_ОбновитьПраваДоступа" Тогда 
		ОбновитьПраваДоступа();
		ОбновитьОтображениеПолейФормы();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ОбновитьПланПродаж(Команда)
	
	ОбновитьПланПродажНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ОткрываемыйДокумент = ОпределитьРеквизитВыделеннойСтроки("Документ");
	
	Если ЗначениеЗаполнено(ОткрываемыйДокумент) Тогда 
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", ОткрываемыйДокумент);
		ОткрытьФорму("Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	СогласуемыйДокумент = ОпределитьРеквизитВыделеннойСтроки("Документ");
	
	Если ЗначениеЗаполнено(СогласуемыйДокумент) Тогда 
		СогласоватьНаСервере(СогласуемыйДокумент);
		Оповестить("ПланПродаж_ОбновитьПраваДоступа");	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НаПодготовку(Команда)
	
	ПодготавливаемыйДокумент = ОпределитьРеквизитВыделеннойСтроки("Документ");
	
	Если ЗначениеЗаполнено(ПодготавливаемыйДокумент) Тогда 
		НаПодготовкуНаСервере(ПодготавливаемыйДокумент);
		Оповестить("ПланПродаж_ОбновитьПраваДоступа");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПланПродаж(Команда)
	
	Если ЗначениеЗаполнено(ПериодПлана) Тогда 
		Статус = ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаПодготовке");
		СформироватьПланПродажНаСервере(Статус);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран период планирования.",, "ПериодПлана");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаСогласование(Команда)
	
	Если ЗначениеЗаполнено(ПериодПлана) Тогда 
		НаСогласованиеНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран период планирования.",, "ПериодПлана");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПраваДоступа()
	
	ПраваДоступа				= ИТ_ПланыПродаж.ПолучитьПраваДоступа("Контролер", ДокументОкончательныйПланПродаж.Статус);
	РедактированиеДоступно		= ПраваДоступа.Редактирование;	
	СлужебныеРеквизитыДоступны	= ПраваДоступа.СлужебныеРеквизиты;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПолейФормы()
	
	Элементы.ДокументОкончательныйПланПродаж.КнопкаВыбора	= СлужебныеРеквизитыДоступны;	
	Элементы.ДокументОкончательныйПланПродаж.ТолькоПросмотр	= Не(СлужебныеРеквизитыДоступны);
	
	Элементы.ФормаНаСогласование.Доступность	= РедактированиеДоступно;
	Элементы.ПланПродажСогласовать.Доступность	= РедактированиеДоступно;
	Элементы.ПланПродажНаПодготовку.Доступность	= РедактированиеДоступно;
	
КонецПроцедуры	

&НаКлиенте
Функция ОпределитьРеквизитВыделеннойСтроки(ИмяРеквизита)
	
	ТекущиеДанные = Элементы.ПланПродаж.ТекущиеДанные;
	ЗначениеРеквизита = Неопределено;
	
	Если ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка.",, "Объект.ПланПродаж");
	Иначе
		ЗначениеРеквизита = ТекущиеДанные[ИмяРеквизита];
		
		Если Не(ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда 
			ТекстСообщения = СтрШаблон("Не заполнен реквизит %1.", ИмяРеквизита);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ПланПродаж");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

&НаСервере
Процедура ОбновитьПланПродажНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер КАК СтаршийМенеджер,
		|	СУММА(ИТ_ПланПродаж_Месяц.Сумма) КАК ПредварительнаяСумма
		|ПОМЕСТИТЬ ПредварительныеСуммы
		|ИЗ
		|	РегистрСведений.ИТ_ПланПродаж_Месяц КАК ИТ_ПланПродаж_Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(&ПериодПлана, ) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
		|		ПО ИТ_ПланПродаж_Месяц.ТорговаяТочка = ит_ТорговыеТочки_ОтветственныеСрезПоследних.ТорговаяТочка
		|ГДЕ
		|	ИТ_ПланПродаж_Месяц.Период >= НАЧАЛОПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_ПланПродаж_Месяц.Период <= КОНЕЦПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_ПланПродаж_Месяц.ВидПлана = &ВидПлана
		|
		|СГРУППИРОВАТЬ ПО
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.СтаршийМенеджер КАК СтаршийМенеджер,
		|	СУММА(ВЫБОР
		|			КОГДА ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Статус = ЗНАЧЕНИЕ(Перечисление.ИТ_статусыПлановПродаж.Согласован)
		|				ТОГДА ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_1 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_2 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_3 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_4 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_5 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_6 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_7 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_8 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_9 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_10 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_11 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_12 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_13 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_14 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_15 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_16 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_17 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_18 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_19 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_20 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_21 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_22 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_23 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_24 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_25 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_26 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_27 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_28 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_29 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_30 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_31
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОкончательнаяСумма,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус КАК Статус,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка КАК Документ
		|ПОМЕСТИТЬ ОкончательныеСуммы
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж
		|ГДЕ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Проведен
		|	И (ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ИТ_СтатусыПлановПродаж.НаСогласовании)
		|			ИЛИ ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ИТ_СтатусыПлановПродаж.Согласован))
		|	И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.ПериодПлана >= НАЧАЛОПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.ПериодПлана <= КОНЕЦПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.СтаршийМенеджер,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ПредварительныеСуммы.СтаршийМенеджер, ЕСТЬNULL(ОкончательныеСуммы.СтаршийМенеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))) КАК СтаршийМенеджер,
		|	ЕСТЬNULL(ПредварительныеСуммы.ПредварительнаяСумма, 0) КАК ПредварительнаяСумма,
		|	ЕСТЬNULL(ОкончательныеСуммы.ОкончательнаяСумма, 0) КАК ОкончательнаяСумма,
		|	ЕСТЬNULL(ОкончательныеСуммы.Статус, НЕОПРЕДЕЛЕНО) КАК Статус,
		|	ОкончательныеСуммы.Документ КАК Документ
		|ПОМЕСТИТЬ СводнаяТаблица
		|ИЗ
		|	ПредварительныеСуммы КАК ПредварительныеСуммы
		|		ПОЛНОЕ СОЕДИНЕНИЕ ОкончательныеСуммы КАК ОкончательныеСуммы
		|		ПО ПредварительныеСуммы.СтаршийМенеджер = ОкончательныеСуммы.СтаршийМенеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводнаяТаблица.СтаршийМенеджер КАК СтаршийМенеджер,
		|	СводнаяТаблица.ПредварительнаяСумма КАК ПредварительнаяСумма,
		|	СводнаяТаблица.ОкончательнаяСумма КАК ОкончательнаяСумма,
		|	СводнаяТаблица.ОкончательнаяСумма - СводнаяТаблица.ПредварительнаяСумма КАК Отклонение,
		|	СводнаяТаблица.Статус КАК Статус,
		|	СводнаяТаблица.Документ КАК Документ
		|ИЗ
		|	СводнаяТаблица КАК СводнаяТаблица";
	
	Запрос.УстановитьПараметр("ПериодПлана",	ПериодПлана);
	Запрос.УстановитьПараметр("ВидПлана",		Перечисления.ИТ_ВидыПлановПродаж.Предварительный);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ТаблицаДанных		= РезультатЗапроса.Выгрузить();
	
	ПланПродаж.Загрузить(ТаблицаДанных);
	
	ИтогоПредварительнаяСумма	= ПланПродаж.Итог("ПредварительнаяСумма");
	ИтогоОкончательнаяСумма		= ПланПродаж.Итог("ОкончательнаяСумма");
	ИтогоОтклонение				= ПланПродаж.Итог("Отклонение");
	
	ДокументОкончательныйПланПродаж = ПолучитьОкончательныйПланПродаж();
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере(ДокументСсылка)
	
	ИТ_ПланыПродаж.УстановитьСтатусДокумента(ДокументСсылка, Перечисления.ИТ_СтатусыПлановПродаж.Согласован);
	ОбновитьПланПродажНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаПодготовкуНаСервере(ДокументСсылка)
	
	ИТ_ПланыПродаж.УстановитьСтатусДокумента(ДокументСсылка, Перечисления.ИТ_СтатусыПлановПродаж.НаПодготовке);
	ОбновитьПланПродажНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПланПродажНаСервере(Статус)
	
	// Предварительное обновление данных
	Если Не(ЗначениеЗаполнено(ДокументОкончательныйПланПродаж)) Тогда 
		ДокументОкончательныйПланПродаж = ПолучитьОкончательныйПланПродаж();
	КонецЕсли;
		
	Если Не(ЗначениеЗаполнено(ДокументОкончательныйПланПродаж)) Тогда 
		ДокументОбъект		= Документы.ИТ_УстановкаПланаПродаж_Месяц.СоздатьДокумент();
		ДокументПроведен	= Ложь;

		ДокументОбъект.Дата			= ТекущаяДата();
		ДокументОбъект.ПериодПлана	= НачалоМесяца(ПериодПлана);
		ДокументОбъект.ВидПлана		= Перечисления.ИТ_ВидыПлановПродаж.Окончательный;
		ДокументОбъект.Статус		= Статус;
		
		ДокументОбъект.ЗаполнитьПланПродаж();
		ИТ_ЛогированиеСервер.ЗаписатьПровестиДокумент(ДокументОбъект,,,,,,, РежимЗаписиДокумента.Проведение, ДокументПроведен);
		
		Если ДокументПроведен Тогда 
			ДокументОкончательныйПланПродаж = ДокументОбъект.Ссылка;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ плана продаж.",, "ДокументОкончательныйПланПродаж");
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ уже сформирован.",, "ДокументОкончательныйПланПродаж");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НаСогласованиеНаСервере()
	
	Если ЗначениеЗаполнено(ДокументОкончательныйПланПродаж) Тогда 
		ИТ_ПланыПродаж.УстановитьСтатусДокумента(ДокументОкончательныйПланПродаж, Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании);
	Иначе
		СформироватьПланПродажНаСервере(Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании);	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОкончательныйПланПродаж()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_Месяц.Ссылка КАК Документ
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_Месяц КАК ИТ_УстановкаПланаПродаж_Месяц
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ИТ_УстановкаПланаПродаж_Месяц.ПериодПлана, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_УстановкаПланаПродаж_Месяц.ВидПлана = &ВидПлана
		|	И НЕ ИТ_УстановкаПланаПродаж_Месяц.ПометкаУдаления
		|	И ИТ_УстановкаПланаПродаж_Месяц.Проведен";
	
	Запрос.УстановитьПараметр("ПериодПлана",	ПериодПлана);
	Запрос.УстановитьПараметр("ВидПлана",		Перечисления.ИТ_ВидыПлановПродаж.Окончательный);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Документ;
	Иначе
		Возврат Документы.ИТ_УстановкаПланаПродаж_Месяц.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
